doraorak/ESP32FirmataSwift/main/firmata_shim.cpp
/* ===----------------------------------------------------------------------===//
   firmata_shim.cpp — BRIDGING ONLY.
   No implementation logic lives here. Every function is a thin wrapper over a
   vendor (Arduino / ESP-IDF) API so Embedded Swift can reach it. The protocol,
   Scheduler, logic extension, transport orchestration (Wi-Fi/Bonjour/TCP + BLE),
   arbitration and the main loop are all in Main.swift.
   Two things are unavoidably C++ and are kept to pure forwarding:
     * BLE callback classes — Swift can't subclass a C++ class, so these just
       push bytes into a FIFO / set event flags that Swift polls.
     * `app_main` — the ESP-IDF entry; it inits Arduino and calls Swift `sw_main`.
   String arguments are passed from Swift as `const uint8_t*` (StaticString /
   byte buffers) and cast to `char*` here.
   ===----------------------------------------------------------------------===// */
#include "Arduino.h"
#include "esp_log.h"
#include "WiFi.h"
#include "WiFiClientSecure.h"   // HTTPS (TLS via ssl_client / mbedTLS)
#include "HTTPClient.h"
#include "ESPmDNS.h"
#include "Wire.h"
#include "driver/i2s_std.h"    // I2S RX for digital MEMS mics (INMP441 etc.)

/* IDF certificate bundle (CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y) — browser-like
   root CA set, so HTTPS certs are validated. Same approach works in the Arduino
   sketch (the core embeds the same bundle). */
extern const uint8_t fm_crt_bundle_start[] asm("_binary_x509_crt_bundle_start");
extern const uint8_t fm_crt_bundle_end[]   asm("_binary_x509_crt_bundle_end");
#include "BLEDevice.h"
#include "BLEServer.h"
#include "BLEUtils.h"
#include "BLE2902.h"

/* ==== Encrypted Wi-Fi provisioning crypto + NVS (mbedTLS + Preferences).
    Ephemeral X25519 ECDH -> HKDF-SHA256 -> AES-256-GCM. Mirrors the C++
    firmware (ESP32Firmata); Swift drives it via fm_wc_* / fm_nvs_* below.
   ==================== */
#include <Preferences.h>
#include <esp_random.h>
#include <mbedtls/ecdh.h>
#include <mbedtls/ecp.h>
#include <mbedtls/bignum.h>
#include <mbedtls/gcm.h>
#include <mbedtls/hkdf.h>
#include <mbedtls/md.h>
#include <mbedtls/platform_util.h>

static const char WC_HKDF_SALT[] = "firmata-wifi-prov-v1";   // must match the client
static int wc_rng(void *, unsigned char *out, size_t len) { esp_fill_random(out, len); return 0; }
static mbedtls_ecp_group wcGrp; static mbedtls_mpi wcPriv;
static bool wcGrpInit = false, wcHavePriv = false;

// HKDF-SHA256 (RFC 5869) from HMAC — IDF's mbedTLS config omits mbedtls_hkdf, but
// HMAC is always present. Single-block expand (outLen <= 32 == hashLen).
static int wc_hkdf_sha256(const uint8_t *salt, size_t saltLen,
                          const uint8_t *ikm, size_t ikmLen,
                          const uint8_t *info, size_t infoLen,
                          uint8_t *out, size_t outLen) {
  const mbedtls_md_info_t *md = mbedtls_md_info_from_type(MBEDTLS_MD_SHA256);
  if (!md || outLen > 32) return -1;
  uint8_t prk[32], t[32];
  int rc = -1;
  if (mbedtls_md_hmac(md, salt, saltLen, ikm, ikmLen, prk) == 0) {     // extract
    mbedtls_md_context_t ctx; mbedtls_md_init(&ctx);
    if (mbedtls_md_setup(&ctx, md, 1) == 0 &&
        mbedtls_md_hmac_starts(&ctx, prk, 32) == 0 &&
        (infoLen == 0 || mbedtls_md_hmac_update(&ctx, info, infoLen) == 0)) {
      uint8_t one = 0x01;                                              // expand T(1)
      if (mbedtls_md_hmac_update(&ctx, &one, 1) == 0 &&
          mbedtls_md_hmac_finish(&ctx, t) == 0) {
        memcpy(out, t, outLen); rc = 0;
      }
    }
    mbedtls_md_free(&ctx);
  }
  mbedtls_platform_zeroize(prk, sizeof(prk));
  mbedtls_platform_zeroize(t, sizeof(t));
  return rc;
}

extern "C" {

// Start a handshake: fresh ephemeral keypair; output our 32-byte public key.
int fm_wc_begin(uint8_t *outPub32) {
  if (!wcGrpInit) {
    mbedtls_ecp_group_init(&wcGrp);
    if (mbedtls_ecp_group_load(&wcGrp, MBEDTLS_ECP_DP_CURVE25519) != 0) return 0;
    wcGrpInit = true;
  }
  if (wcHavePriv) { mbedtls_mpi_free(&wcPriv); wcHavePriv = false; }
  mbedtls_mpi_init(&wcPriv);
  mbedtls_ecp_point Q; mbedtls_ecp_point_init(&Q);
  int rc = mbedtls_ecdh_gen_public(&wcGrp, &wcPriv, &Q, wc_rng, nullptr);
  if (rc == 0) rc = mbedtls_mpi_write_binary_le(&Q.MBEDTLS_PRIVATE(X), outPub32, 32);
  mbedtls_ecp_point_free(&Q);
  if (rc == 0) { wcHavePriv = true; return 1; }
  mbedtls_mpi_free(&wcPriv); return 0;
}

// Finish: ECDH with the peer pubkey, HKDF-SHA256 -> 32-byte AES key. One-shot.
int fm_wc_derive_key(const uint8_t *peerPub32, uint8_t *outKey32) {
  if (!wcHavePriv) return 0;
  mbedtls_ecp_point Qp; mbedtls_ecp_point_init(&Qp);
  mbedtls_mpi z; mbedtls_mpi_init(&z);
  uint8_t secret[32]; int ok = 0;
  if (mbedtls_mpi_read_binary_le(&Qp.MBEDTLS_PRIVATE(X), peerPub32, 32) == 0 &&
      mbedtls_mpi_lset(&Qp.MBEDTLS_PRIVATE(Z), 1) == 0 &&
      mbedtls_ecdh_compute_shared(&wcGrp, &z, &Qp, &wcPriv, wc_rng, nullptr) == 0 &&
      mbedtls_mpi_write_binary_le(&z, secret, 32) == 0) {
    if (wc_hkdf_sha256((const uint8_t *)WC_HKDF_SALT, sizeof(WC_HKDF_SALT) - 1,
                       secret, 32, nullptr, 0, outKey32, 32) == 0) ok = 1;
  }
  mbedtls_platform_zeroize(secret, sizeof(secret));
  mbedtls_mpi_free(&z); mbedtls_ecp_point_free(&Qp);
  mbedtls_mpi_free(&wcPriv); wcHavePriv = false;
  return ok;
}

int fm_wc_gcm_decrypt(const uint8_t *key32, const uint8_t *nonce12,
                      const uint8_t *ct, int ctLen, const uint8_t *tag16, uint8_t *outPt) {
  mbedtls_gcm_context g; mbedtls_gcm_init(&g);
  int ok = (mbedtls_gcm_setkey(&g, MBEDTLS_CIPHER_ID_AES, key32, 256) == 0 &&
            mbedtls_gcm_auth_decrypt(&g, (size_t)ctLen, nonce12, 12, nullptr, 0,
                                     tag16, 16, ct, outPt) == 0) ? 1 : 0;
  mbedtls_gcm_free(&g);
  return ok;
}

// NVS-stored creds (Preferences namespace "wifiprov"). Returns 1 if creds exist.
int fm_nvs_load_creds(uint8_t *ssid, int ssidCap, uint8_t *pass, int passCap) {
  Preferences p; p.begin("wifiprov", true);
  String s = p.getString("ssid", ""); String w = p.getString("pass", "");
  p.end();
  if (s.length() == 0) return 0;
  strncpy((char *)ssid, s.c_str(), ssidCap - 1); ssid[ssidCap - 1] = 0;
  strncpy((char *)pass, w.c_str(), passCap - 1); pass[passCap - 1] = 0;
  return 1;
}
void fm_nvs_save_creds(const uint8_t *ssid, const uint8_t *pass) {
  Preferences p; p.begin("wifiprov", false);
  p.putString("ssid", (const char *)ssid);
  p.putString("pass", (const char *)pass);
  p.end();
}
void fm_nvs_clear_creds(void) { Preferences p; p.begin("wifiprov", false); p.clear(); p.end(); }

