doraorak/ESP32FirmataSwift/main/firmata_shim.cpp
/* ==== I2S RX for digital MEMS microphones (INMP441 / SPH0645) =============
   A continuous DMA audio stream — far too fast/large to pass to the host raw
   (that's why the mic module reduces it to RMS/dB on-device). Standard Philips
   32-bit slots, mono; the INMP441 puts its 24-bit sample in the top bits, so a
   read is shifted right 8 to recover the signed 24-bit value. L/R→GND selects
   the LEFT slot. */
static i2s_chan_handle_t fm_i2s_rx = NULL;

int          fm_i2s_mic_begin(int bclk, int ws, int sd, int sampleRate) {
  if (fm_i2s_rx) { i2s_channel_disable(fm_i2s_rx); i2s_del_channel(fm_i2s_rx); fm_i2s_rx = NULL; }
  i2s_chan_config_t chan_cfg = I2S_CHANNEL_DEFAULT_CONFIG(I2S_NUM_AUTO, I2S_ROLE_MASTER);
  if (i2s_new_channel(&chan_cfg, NULL, &fm_i2s_rx) != ESP_OK) return 0;
  // STEREO on purpose: the INMP441's data lands on whichever slot its L/R pin selects,
  // and that mapping is famously inconsistent on the ESP32. Reading both slots and taking
  // RMS over all samples sidesteps the guessing — the silent slot just contributes zeros.
  i2s_std_config_t std_cfg = {
    .clk_cfg  = I2S_STD_CLK_DEFAULT_CONFIG((uint32_t)sampleRate),
    .slot_cfg = I2S_STD_PHILIPS_SLOT_DEFAULT_CONFIG(I2S_DATA_BIT_WIDTH_32BIT, I2S_SLOT_MODE_STEREO),
    .gpio_cfg = {
      .mclk = I2S_GPIO_UNUSED,
      .bclk = (gpio_num_t)bclk,
      .ws   = (gpio_num_t)ws,
      .dout = I2S_GPIO_UNUSED,
      .din  = (gpio_num_t)sd,
      .invert_flags = { .mclk_inv = false, .bclk_inv = false, .ws_inv = false },
    },
  };
  if (i2s_channel_init_std_mode(fm_i2s_rx, &std_cfg) != ESP_OK) {
    i2s_del_channel(fm_i2s_rx); fm_i2s_rx = NULL; return 0;
  }
  if (i2s_channel_enable(fm_i2s_rx) != ESP_OK) {
    i2s_del_channel(fm_i2s_rx); fm_i2s_rx = NULL; return 0;
  }
  return 1;
}

float        fm_i2s_mic_rms(void) {
  if (!fm_i2s_rx) return -1;
  static int32_t buf[256];
  size_t bytesRead = 0;
  if (i2s_channel_read(fm_i2s_rx, buf, sizeof(buf), &bytesRead, 100) != ESP_OK) return -1;
  int n = (int)(bytesRead / sizeof(int32_t));
  if (n < 8) return -1;
  double sum = 0, sumsq = 0;                     // DC-removed RMS over the block
  for (int i = 0; i < n; i++) { double s = (double)(buf[i] >> 8); sum += s; sumsq += s * s; }
  double mean = sum / n;
  double var = sumsq / n - mean * mean;
  if (var < 0) var = 0;
  return (float)sqrt(var);
}

/* Diagnostic: the largest-magnitude RAW 32-bit sample in a block (pre-shift). Zero means
   SD delivered nothing (dead/unpowered mic or a wiring fault); a large value with no RMS
   reaction points at the bit extraction instead. */
int32_t      fm_i2s_mic_peak_raw(void) {
  if (!fm_i2s_rx) return -1;
  static int32_t buf[256];
  size_t bytesRead = 0;
  if (i2s_channel_read(fm_i2s_rx, buf, sizeof(buf), &bytesRead, 100) != ESP_OK) return -1;
  int n = (int)(bytesRead / sizeof(int32_t));
  int32_t peak = 0;
  for (int i = 0; i < n; i++) { int32_t a = buf[i] < 0 ? -buf[i] : buf[i]; if (a > peak) peak = a; }
  return peak;
}

/* Dominant frequency (Hz) of the I2S mic's left channel over a 512-sample window: Hann-window +
   radix-2 FFT, take the biggest magnitude bin, parabolically interpolate its true peak. Returns
   0 when no bin stands out (silence/broadband noise — peak not ≥ 6× the mean), -1 on read error.
   ~512 samples is 32 ms at 16 kHz; fine at window cadence. */
static const int FM_FFT_N = 512;
float        fm_i2s_mic_dominant_hz(int sampleRate) {
  if (!fm_i2s_rx) return -1;
  static float re[FM_FFT_N], im[FM_FFT_N];
  static int32_t rd[256];
  const float kTwoPi = 6.283185307179586f;
  int got = 0, attempts = 0;
  while (got < FM_FFT_N && attempts < 8) {                 // one DMA read is < 512 frames; collect
    size_t br = 0;
    if (i2s_channel_read(fm_i2s_rx, rd, sizeof(rd), &br, 100) != ESP_OK) break;
    int frames = (int)(br / sizeof(int32_t)) / 2;          // STEREO: 2 int32 per frame
    for (int i = 0; i < frames && got < FM_FFT_N; i++) { re[got] = (float)(rd[2 * i] >> 8); im[got] = 0.0f; got++; }
    attempts++;
  }
  if (got < FM_FFT_N) return -1;
  double mean = 0; for (int i = 0; i < FM_FFT_N; i++) mean += re[i]; mean /= FM_FFT_N;
  for (int i = 0; i < FM_FFT_N; i++) {                     // DC-remove + Hann window
    float w = 0.5f * (1.0f - cosf(kTwoPi * i / (FM_FFT_N - 1)));
    re[i] = (re[i] - (float)mean) * w;
  }
  for (int i = 1, j = 0; i < FM_FFT_N; i++) {              // bit-reversal permutation
    int bit = FM_FFT_N >> 1;
    for (; j & bit; bit >>= 1) j ^= bit;
    j ^= bit;
    if (i < j) { float t; t = re[i]; re[i] = re[j]; re[j] = t; t = im[i]; im[i] = im[j]; im[j] = t; }
  }
  for (int len = 2; len <= FM_FFT_N; len <<= 1) {          // Cooley-Tukey butterflies
    float ang = -kTwoPi / len, wlR = cosf(ang), wlI = sinf(ang);
    for (int i = 0; i < FM_FFT_N; i += len) {
      float wR = 1, wI = 0;
      for (int k = 0; k < len / 2; k++) {
        int a = i + k, b = a + len / 2;
        float vR = re[b] * wR - im[b] * wI, vI = re[b] * wI + im[b] * wR;
        re[b] = re[a] - vR; im[b] = im[a] - vI;
        re[a] += vR;        im[a] += vI;
        float nwR = wR * wlR - wI * wlI; wI = wR * wlI + wI * wlR; wR = nwR;
      }
    }
  }
  int minBin = (int)(50.0f * FM_FFT_N / sampleRate); if (minBin < 1) minBin = 1;   // ignore rumble < 50 Hz
  int maxBin = FM_FFT_N / 2, peakBin = minBin;
  float peakMag = -1; double magSum = 0;
  for (int b = minBin; b < maxBin; b++) {
    float m = re[b] * re[b] + im[b] * im[b];
    magSum += m;
    if (m > peakMag) { peakMag = m; peakBin = b; }
  }
  double meanMag = magSum / (maxBin - minBin);
  if (peakMag < 6.0 * meanMag) return 0;                  // no bin dominates → no tone
  float delta = 0;                                        // parabolic peak interpolation
  if (peakBin > minBin && peakBin < maxBin - 1) {
    float a = re[peakBin-1]*re[peakBin-1] + im[peakBin-1]*im[peakBin-1];
    float b = peakMag;
    float c = re[peakBin+1]*re[peakBin+1] + im[peakBin+1]*im[peakBin+1];
    float d = a - 2*b + c;
    if (d != 0) delta = 0.5f * (a - c) / d;
  }
  return (peakBin + delta) * (float)sampleRate / FM_FFT_N;
}
void         fm_dac_write(int32_t pin, int32_t v) {
  if (v < 0) v = 0;
  if (v > 255) v = 255;
  dacWrite((uint8_t)pin, (uint8_t)v);
}
/* PWM_CONFIG pins bypass the Arduino core's LEDC layer entirely: the core's
   analogWrite* / ledcChangeFrequency retune paths proved flaky on hardware
   (different melody notes died on different runs). Each configured pin gets
   its own IDF-direct LOW-SPEED timer+channel, allocated from the TOP of the
   range so the core's own bottom-up allocation (servo, plain .pwm analogWrite)
   never collides until 12+ simultaneous channels. Retune = ledc_set_freq only.
   (fm_ledc_on above is the servo ledger for the core-managed channels.) */
#include "driver/ledc.h"
#define FM_LEDC_SLOTS 4
static int fm_ledc_pin[FM_LEDC_SLOTS] = { -1, -1, -1, -1 };
static int fm_ledc_res[FM_LEDC_SLOTS] = { 8, 8, 8, 8 };
static int fm_ledc_slot_of(int pin) {
  for (int i = 0; i < FM_LEDC_SLOTS; i++) if (fm_ledc_pin[i] == pin) return i;
  return -1;
}
static void fm_ledc_timer_init(int slot, int32_t freq_hz, int32_t res_bits) {
  ledc_timer_config_t t = {};
  t.speed_mode      = LEDC_LOW_SPEED_MODE;
  t.duty_resolution = (ledc_timer_bit_t)res_bits;
  t.timer_num       = (ledc_timer_t)(3 - slot);
  t.freq_hz         = (uint32_t)freq_hz;
  t.clk_cfg         = LEDC_AUTO_CLK;
  ledc_timer_config(&t);
}
bool fm_ledc_on[SOC_GPIO_PIN_COUNT] = { false };
void         fm_ledc_config(int32_t pin, int32_t freq_hz, int32_t res_bits) {
  if (res_bits < 1) res_bits = 1;
  if (res_bits > 14) res_bits = 14;
  int slot = fm_ledc_slot_of((int)pin);
  if (slot < 0) {                                      // first config: claim a slot
    for (int i = 0; i < FM_LEDC_SLOTS; i++) if (fm_ledc_pin[i] < 0) { slot = i; break; }
    if (slot < 0) return;                              // all 4 slots busy
    fm_ledc_pin[slot] = (int)pin;
    fm_ledc_res[slot] = (int)res_bits;
    fm_ledc_timer_init(slot, freq_hz, res_bits);
    ledc_channel_config_t c = {};
    c.gpio_num   = (int)pin;
    c.speed_mode = LEDC_LOW_SPEED_MODE;
    c.channel    = (ledc_channel_t)(7 - slot);
    c.intr_type  = LEDC_INTR_DISABLE;
    c.timer_sel  = (ledc_timer_t)(3 - slot);
    c.duty       = 0;
    c.hpoint     = 0;
    ledc_channel_config(&c);
  } else if ((int)res_bits != fm_ledc_res[slot]) {     // resolution change: re-init timer
    fm_ledc_res[slot] = (int)res_bits;
    fm_ledc_timer_init(slot, freq_hz, res_bits);
  } else {                                             // retune only — deterministic
    ledc_set_freq(LEDC_LOW_SPEED_MODE, (ledc_timer_t)(3 - slot), (uint32_t)freq_hz);
  }
}

/* Duty write that routes PWM_CONFIG-managed pins to their IDF channel and
   everything else through the Arduino core's analogWrite. */
void         fm_pwm_write(int32_t pin, int32_t duty) {
  int slot = fm_ledc_slot_of((int)pin);
  if (slot >= 0) {
    // duty == max -> write max+1: LEDC's constant-high point (true 100%, no spike train)
    uint32_t d = (uint32_t)duty;
    uint32_t max = (1u << fm_ledc_res[slot]) - 1u;
    if (d >= max) d = max + 1u;
    ledc_set_duty(LEDC_LOW_SPEED_MODE, (ledc_channel_t)(7 - slot), d);
    ledc_update_duty(LEDC_LOW_SPEED_MODE, (ledc_channel_t)(7 - slot));
  } else {
    analogWrite((uint8_t)pin, (int)duty);
  }
}

