doraorak/ESP32FirmataSwift/main/firmata_shim.cpp
/* ==== Module hardware primitives (sonar / DHT) =========================== */
/* HC-SR04: 10 us trigger pulse, then measure the echo-high width. Blocking up
   to timeout_us (~25 ms at 4 m) — acceptable once per handle()/tick(). */
int32_t      fm_sonar_ping_us(int32_t trig, int32_t echo, int32_t timeout_us) {
  digitalWrite((uint8_t)trig, LOW);  delayMicroseconds(2);
  digitalWrite((uint8_t)trig, HIGH); delayMicroseconds(10);
  digitalWrite((uint8_t)trig, LOW);
  unsigned long us = pulseIn((uint8_t)echo, HIGH, (unsigned long)timeout_us);
  return (int32_t)us;                       // 0 on timeout
}

/* DHT11/22 bit-bang read (type 0=DHT11, 1=DHT22). 40 bits, bit value decided by
   the high-pulse width (~26-28 us = 0, ~70 us = 1). Returns 0 ok, -1 fail.
   Timing-critical: the line release and every sample use DIRECT GPIO registers
   (Arduino pinMode/digitalRead can burn >100 us in peripheral bookkeeping, which
   desynchronises the 26-70 us bit stream), and the whole ~4 ms window runs with
   interrupts masked. Direct-register path covers GPIO 0-31 (use those pins). */
#include "soc/gpio_struct.h"
static inline int dhtLvl(uint32_t bit) { return (GPIO.in & bit) ? 1 : 0; }
static int dhtWaitBit(uint32_t bit, int level, uint32_t timeout_us) {
  uint32_t t0 = micros();
  while (dhtLvl(bit) != level) {
    if ((uint32_t)(micros() - t0) > timeout_us) return -1;
  }
  return (int)(uint32_t)(micros() - t0);
}
int32_t      fm_dht_read(int32_t pin32, int32_t type, float *temp_c, float *hum_pct) {
  if (pin32 < 0 || pin32 >= 32) return -1;             // direct-reg path: GPIO 0-31
  uint8_t pin = (uint8_t)pin32;
  uint32_t bit = 1UL << pin;
  uint8_t data[5] = {0, 0, 0, 0, 0};

  // Configure pull-up once; drive the start signal via direct output-enable.
  pinMode(pin, INPUT_PULLUP);
  GPIO.out_w1tc = bit;                                 // latched LOW when output enables
  GPIO.enable_w1ts = bit;                              // drive low (start signal)
  delay(20);                                           // >=18 ms covers DHT11 and DHT22

  static portMUX_TYPE dhtMux = portMUX_INITIALIZER_UNLOCKED;
  bool fail = false;
  taskENTER_CRITICAL(&dhtMux);
  GPIO.enable_w1tc = bit;                              // release: pull-up snaps high (~ns)
  // Sensor response: low within 20-40 us, then ~80 us low / ~80 us high, then 40 bits.
  if (dhtWaitBit(bit, 0, 90)  < 0 ||
      dhtWaitBit(bit, 1, 120) < 0 ||
      dhtWaitBit(bit, 0, 120) < 0) {
    fail = true;
  } else {
    for (int i = 0; i < 40; i++) {
      if (dhtWaitBit(bit, 1, 80) < 0) { fail = true; break; }        // ~50 us low preamble
      int high = dhtWaitBit(bit, 0, 110);                            // bit = high-pulse width
      if (high < 0) { fail = true; break; }
      data[i / 8] <<= 1;
      if (high > 45) data[i / 8] |= 1;                               // ~26 us = 0, ~70 us = 1
    }
  }
  taskEXIT_CRITICAL(&dhtMux);
  if (fail) return -1;
  if ((uint8_t)(data[0] + data[1] + data[2] + data[3]) != data[4]) return -1;

  if (type == 0) {                                     // DHT11: integral bytes
    *hum_pct = (float)data[0] + (float)data[1] * 0.1f;
    *temp_c  = (float)data[2] + (float)(data[3] & 0x7F) * 0.1f;
  } else {                                             // DHT22: 10ths, sign bit on temp
    *hum_pct = ((float)(((uint16_t)data[0] << 8) | data[1])) * 0.1f;
    float t  = ((float)(((uint16_t)(data[2] & 0x7F) << 8) | data[3])) * 0.1f;
    *temp_c  = (data[2] & 0x80) ? -t : t;
  }
  return 0;
}

// I2C (Wire)
void fm_i2c_begin(int sda, int scl)       { Wire.begin((uint8_t)sda, (uint8_t)scl); }
void fm_i2c_begin_transmission(int addr)  { Wire.beginTransmission((uint8_t)addr); }
void fm_i2c_write(int b)                  { Wire.write((uint8_t)b); }
int  fm_i2c_end_transmission(int stop)    { return Wire.endTransmission((bool)stop); }
int  fm_i2c_request_from(int addr, int n) { return Wire.requestFrom(addr, n); }
int  fm_i2c_available(void)               { return Wire.available(); }
int  fm_i2c_read(void)                    { return Wire.read(); }

/* ==== Wi-Fi / mDNS  (each call is one vendor API; Swift sequences them) ==== */
void fm_wifi_begin(const uint8_t *ssid, const uint8_t *pass, const uint8_t *host) {
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  WiFi.setAutoReconnect(true);
  WiFi.setHostname((const char *)host);
  WiFi.begin((const char *)ssid, (const char *)pass);
}
int  fm_wifi_connected(void) { return WiFi.status() == WL_CONNECTED ? 1 : 0; }
// 1 if already joined to exactly this ssid+pass (so a re-provision needn't tear it down).
int  fm_wifi_same_network(const uint8_t *ssid, const uint8_t *pass) {
  if (WiFi.status() != WL_CONNECTED) return 0;
  return (WiFi.SSID() == String((const char *)ssid) && WiFi.psk() == String((const char *)pass)) ? 1 : 0;
}
int  fm_wifi_localip(uint8_t *out, int n) {
  String s = WiFi.localIP().toString();
  strncpy((char *)out, s.c_str(), n - 1); out[n - 1] = 0;
  return (int)strlen((char *)out);
}
int  fm_mdns_begin(const uint8_t *host) { MDNS.end(); return MDNS.begin((const char *)host) ? 1 : 0; }
void fm_mdns_add_service(const uint8_t *svc, const uint8_t *proto, int port) {
  MDNS.addService((const char *)svc, (const char *)proto, port);
}
void fm_mdns_add_txt(const uint8_t *svc, const uint8_t *proto, const uint8_t *k, const uint8_t *v) {
  MDNS.addServiceTxt((const char *)svc, (const char *)proto, (const char *)k, (const char *)v);
}

/* ==== HTTP client  (Arduino HTTPClient over Wi-Fi; Swift sequences the call and
    decides what to do with the result). Response body is held here until the
    next request; Swift copies it out via fm_http_resp_len / fm_http_resp_copy.
   ==================== */
} // extern "C"
static String httpBody;
extern "C" {
// method: 0=GET, 1=POST. url/body/content_type are null-terminated.
// Returns the HTTP status code, or <=0 on error (0 = Wi-Fi down / bad URL).
int fm_http_request(const uint8_t *url, int is_post,
                    const uint8_t *body, const uint8_t *content_type) {
  httpBody = "";
  if (WiFi.status() != WL_CONNECTED) return 0;
  bool https = (strncmp((const char *)url, "https", 5) == 0);
  HTTPClient http;
  http.setConnectTimeout(8000);
  http.setTimeout(8000);
  http.setReuse(false);
  http.setFollowRedirects(HTTPC_FORCE_FOLLOW_REDIRECTS);
  WiFiClientSecure tls;
  WiFiClient plain;
  bool ok;
  if (https) {
    tls.setCACertBundle(fm_crt_bundle_start,
                        (size_t)(fm_crt_bundle_end - fm_crt_bundle_start));  // validate certs
    ok = http.begin(tls, (const char *)url);
  } else {
    ok = http.begin(plain, (const char *)url);
  }
  if (!ok) return 0;
  int code;
  if (is_post) {
    if (content_type && content_type[0]) http.addHeader("Content-Type", (const char *)content_type);
    code = http.POST((uint8_t *)body, body ? strlen((const char *)body) : 0);
  } else {
    code = http.GET();
  }
  if (code > 0) httpBody = http.getString();
  http.end();
  return code;
}
int fm_http_resp_len(void) { return (int)httpBody.length(); }
// Borrow the retained body in place (Swift walks it directly — no copy).
const uint8_t *fm_http_resp_ptr(void) { return (const uint8_t *)httpBody.c_str(); }
// Heap stats so a task can size-gate before allocating.
int fm_free_heap(void)         { return (int)ESP.getFreeHeap(); }
int fm_largest_free_block(void) {
  return (int)heap_caps_get_largest_free_block(MALLOC_CAP_8BIT | MALLOC_CAP_INTERNAL);
}

/* ---- JSON snapshot slots: owned copies of a response (sub)value that survive
        the next request. Grow-only buffers (realloc only when bigger) to avoid
        heap-fragmenting churn. Stable pointers so Swift can walk them in place. */
#define FM_NUM_SNAP 12
static uint8_t *fm_snap[FM_NUM_SNAP]    = {nullptr};   // rest zero-initialised
static int      fm_snapCap[FM_NUM_SNAP] = {0};
static int      fm_snapLen[FM_NUM_SNAP] = {0};
// Returns 1 on success, 0 on alloc failure.
int fm_snapshot_copy(int slot, const uint8_t *src, int len) {
  if (slot < 0 || slot >= FM_NUM_SNAP || len < 0) return 0;
  if (len > fm_snapCap[slot]) {                 // grow-only: never shrink the buffer
    uint8_t *nb = (uint8_t *)realloc(fm_snap[slot], (size_t)len);
    if (!nb) { return 0; }
    fm_snap[slot] = nb; fm_snapCap[slot] = len;
  }
  if (len > 0) memcpy(fm_snap[slot], src, (size_t)len);
  fm_snapLen[slot] = len;
  return 1;
}
const uint8_t *fm_snapshot_ptr(int slot) { return (slot >= 0 && slot < FM_NUM_SNAP) ? fm_snap[slot] : nullptr; }
int fm_snapshot_len(int slot)            { return (slot >= 0 && slot < FM_NUM_SNAP) ? fm_snapLen[slot] : 0; }
void fm_snapshot_free(int slot) {
  if (slot < 0 || slot >= FM_NUM_SNAP) return;
  free(fm_snap[slot]); fm_snap[slot] = nullptr; fm_snapCap[slot] = 0; fm_snapLen[slot] = 0;
}
int fm_http_resp_copy(uint8_t *dst, int max) {
  int n = (int)httpBody.length();
  if (n > max) n = max;
  memcpy(dst, httpBody.c_str(), (size_t)n);
  return n;
}
} // extern "C"

/* ==== TCP server / client  (one vendor op each; Swift drives accept/read/write) ==== */
static WiFiServer *tcpServer = nullptr;
static WiFiClient  tcpClient;
static WiFiClient  tcpIncoming;
extern "C" {
void fm_tcp_begin(int port)   { if (!tcpServer) tcpServer = new WiFiServer((uint16_t)port);
                                tcpServer->begin(); tcpServer->setNoDelay(true); }
int  fm_tcp_poll_new(void)    { if (!tcpServer) return 0; WiFiClient c = tcpServer->available();
                                if (c) { tcpIncoming = c; return 1; } return 0; }
void fm_tcp_promote(void)     { tcpClient = tcpIncoming; tcpClient.setNoDelay(true); }
int  fm_tcp_connected(void)   { return (tcpClient && tcpClient.connected()) ? 1 : 0; }
int  fm_tcp_available(void)   { return (tcpClient && tcpClient.connected()) ? tcpClient.available() : 0; }
int  fm_tcp_read(void)        { return tcpClient.read(); }
void fm_tcp_write(const uint8_t *b, int n) { if (tcpClient && tcpClient.connected()) tcpClient.write(b, (size_t)n); }
void fm_tcp_drop(void)        { if (tcpClient && tcpClient.connected()) tcpClient.stop(); }
} // extern "C"

