doraorak/ESP32FirmataSwift/main/firmata_shim.cpp
/* ==== BLE Nordic UART Service.
    Callbacks are pure forwarders into a FIFO / event flags that Swift polls —
    no protocol/transport logic here. (Swift can't subclass these C++ classes.)
   ==================== */
#define NUS_SERVICE_UUID "6E400001-B5A3-F393-E0A9-E50E24DCCA9E"
#define NUS_RX_UUID      "6E400002-B5A3-F393-E0A9-E50E24DCCA9E"
#define NUS_TX_UUID      "6E400003-B5A3-F393-E0A9-E50E24DCCA9E"

static BLEServer         *bleServer = nullptr;
static BLECharacteristic *txChar    = nullptr;
static volatile bool      bleConnected = false;
static volatile uint16_t  bleConnId   = 0;
static volatile bool      connectEvt = false, disconnectEvt = false;
static volatile uint16_t  negMTU = 23;

static const int RXSZ = 2048;
static volatile uint8_t   rxb[RXSZ];
static volatile int       rxh = 0, rxt = 0;
static portMUX_TYPE       rxMux = portMUX_INITIALIZER_UNLOCKED;

class RxCallbacks : public BLECharacteristicCallbacks {
  void onWrite(BLECharacteristic *c) override {        // forward bytes to FIFO
    uint8_t *d = c->getData(); size_t n = c->getLength();
    if (!d || !n) return;
    portENTER_CRITICAL(&rxMux);
    for (size_t i = 0; i < n; i++) { int nh = (rxh + 1) % RXSZ; if (nh != rxt) { rxb[rxh] = d[i]; rxh = nh; } }
    portEXIT_CRITICAL(&rxMux);
  }
};
class ServerCallbacks : public BLEServerCallbacks {
  void onConnect(BLEServer *s, esp_ble_gatts_cb_param_t *p) override {
    uint16_t nc = p->connect.conn_id;
    if (bleConnected && bleConnId != nc) s->disconnect(bleConnId);   // vendor conn mgmt (newest only)
    bleConnId = nc; bleConnected = true; connectEvt = true;
    s->startAdvertising();
  }
  void onDisconnect(BLEServer *s, esp_ble_gatts_cb_param_t *p) override {
    if (p->disconnect.conn_id == bleConnId) { bleConnected = false; negMTU = 23; disconnectEvt = true; }
    s->startAdvertising();
  }
  void onMtuChanged(BLEServer *, esp_ble_gatts_cb_param_t *p) override { negMTU = p->mtu.mtu; }
};

extern "C" {
void fm_ble_begin(const uint8_t *name) {
  BLEDevice::init((const char *)name);
  BLEDevice::setMTU(517);
  bleServer = BLEDevice::createServer();
  bleServer->setCallbacks(new ServerCallbacks());
  BLEService *svc = bleServer->createService(NUS_SERVICE_UUID);
  BLECharacteristic *rxChar = svc->createCharacteristic(
      NUS_RX_UUID, BLECharacteristic::PROPERTY_WRITE | BLECharacteristic::PROPERTY_WRITE_NR);
  rxChar->setCallbacks(new RxCallbacks());
  txChar = svc->createCharacteristic(NUS_TX_UUID, BLECharacteristic::PROPERTY_NOTIFY);
  txChar->addDescriptor(new BLE2902());
  svc->start();
  BLEAdvertising *adv = BLEDevice::getAdvertising();
  BLEAdvertisementData advData;  advData.setFlags(0x06);  advData.setCompleteServices(BLEUUID(NUS_SERVICE_UUID));
  BLEAdvertisementData scanResp; scanResp.setName((const char *)name);
  adv->setAdvertisementData(advData); adv->setScanResponseData(scanResp);
  adv->setMinPreferred(0x06); adv->setMinPreferred(0x12);
  BLEDevice::startAdvertising();
}
int  fm_ble_connected(void)      { return bleConnected ? 1 : 0; }
int  fm_ble_mtu(void)            { return (int)negMTU; }
void fm_ble_notify(const uint8_t *b, int n) {                 // one notification (Swift chunks)
  if (!bleConnected || !txChar) return;
  txChar->setValue((uint8_t *)b, (size_t)n); txChar->notify();
}
void fm_ble_drop(void)           { if (bleConnected && bleServer) bleServer->disconnect(bleConnId); }
int  fm_ble_poll_connect(void)   { if (connectEvt)    { connectEvt = false;    return 1; } return 0; }
int  fm_ble_poll_disconnect(void){ if (disconnectEvt) { disconnectEvt = false; return 1; } return 0; }
int  fm_ble_rx_pop(void) {
  int r = -1;
  portENTER_CRITICAL(&rxMux);
  if (rxt != rxh) { r = rxb[rxt]; rxt = (rxt + 1) % RXSZ; }
  portEXIT_CRITICAL(&rxMux);
  return r;
}

/* ==== ESP-IDF entry — init Arduino, hand everything to Swift. =========== */
void app_main(void) { initArduino(); sw_main(); }
} // extern "C"
